Revit 2027 API
Parameter.Description Property
Returns the tooltip information for a parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
member Description : string with get, set
Property Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if this parameter is built-in.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace